jlab-sensing/ENTS-node-firmware/stm32/Src/lora_app.c
      // start taking measurements
      SensorsStart();
    } else {
      APP_LOG(TS_OFF, VLEVEL_M,
              "Could not sync clock, retrying on next tx\r\n");
    }
    // otherwise return
    return;
  }

  // check if radio is busy
  if (LmHandlerIsBusy()) {
    APP_LOG(TS_ON, VLEVEL_M, "LmHandler is busy\r\n");
    return;
  }

  // check if buffer is empty
  if (FramBufferLen() <= 0) {
    APP_LOG(TS_ON, VLEVEL_M, "Nothing in buffer\r\n");
    return;
  }

  uint8_t battery_level = GetBatteryLevel();
  uint16_t temperature = SYS_GetTemperatureLevel();

  // Get max LoRaWAN payload size
  LoRaMacRegion_t region = 0;
  LmHandlerGetActiveRegion(&region);
  int8_t dr = 0;
  LmHandlerGetTxDatarate(&dr);
  uint8_t max_payload_size = lorawan_max_payload(region, dr);

  PayloadStatus payload_status = PAYLOAD_OK;
  payload_status = FormatPayload(AppData.Buffer, max_payload_size,
                                 (size_t *)&AppData.BufferSize);
  if (payload_status == PAYLOAD_ERROR) {
    APP_LOG(TS_ON, VLEVEL_M, "Error formatting payload\r\n");
    return;
  } else if (payload_status == PAYLOAD_NO_DATA) {
    APP_LOG(TS_ON, VLEVEL_M, "No data to send\r\n");
    return;
  }

  // Old code for measurements
  // FramStatus status = FramGet(AppData.Buffer, &AppData.BufferSize);
  // if (status != FRAM_OK)
  //{
  //  APP_LOG(TS_OFF, VLEVEL_M,
  //          "Error getting data from fram buffer. FramStatus = %d", status);
  //  return;
  //}

  // NOTE: Old code from Steve packet compression
  // size_t size = 0;
  // FramStatus status = FramGet(AppData.Buffer, &size);
  // if (status != FRAM_OK)
  //{
  //  APP_LOG(TS_OFF, VLEVEL_M,
  //          "Error getting data from fram buffer. FramStatus = %d", status);
  //  return;
  //}
  // if (size > LORAWAN_APP_DATA_BUFFER_MAX_SIZE)
  //{
  //  APP_LOG(TS_OFF, VLEVEL_M, "Data size exceeds buffer size\r\n");
  //  return;
  //} else {
  //  AppData.BufferSize = (uint8_t) size;
  //}

  APP_LOG(TS_ON, VLEVEL_M, "Payload (%d): ", AppData.BufferSize);
  for (int i = 0; i < AppData.BufferSize; i++) {
    APP_LOG(TS_OFF, VLEVEL_M, "%02X ", AppData.Buffer[i]);
  }
  APP_LOG(TS_OFF, VLEVEL_M, "\r\n");
  APP_LOG(TS_ON, VLEVEL_M, "%d\r\n", AppData.BufferSize);

  AppData.Port = LORAWAN_SPS_MEAS_GENERIC_PORT;

  LmHandlerErrorStatus_t lmstatus;
  lmstatus =
      LmHandlerSend(&AppData, LORAWAN_DEFAULT_CONFIRMED_MSG_STATE, false);
  if (lmstatus == LORAMAC_HANDLER_SUCCESS) {
    APP_LOG(TS_ON, VLEVEL_L, "SEND REQUEST\r\n");
  } else {
    APP_LOG(TS_OFF, VLEVEL_M, "Could not send request\r\n");
    APP_LOG(TS_OFF, VLEVEL_M, "LmHandlerSend status = %d\r\n", lmstatus);
  }

  StatusLedOff();

  APP_LOG(TS_ON, VLEVEL_M, "Sleeping until next upload\r\n");
  /* USER CODE END SendTxData_1 */
}

static void OnTxTimerEvent(void *context) {
  /* USER CODE BEGIN OnTxTimerEvent_1 */

  /* USER CODE END OnTxTimerEvent_1 */
  UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent),
                   CFG_SEQ_Prio_0);

  /*Wait for next tx slot*/
  UTIL_TIMER_Start(&TxTimer);
  /* USER CODE BEGIN OnTxTimerEvent_2 */

  /* USER CODE END OnTxTimerEvent_2 */
}

/* USER CODE BEGIN PrFD_LedEvents */

/* USER CODE END PrFD_LedEvents */

static void OnTxData(LmHandlerTxParams_t *params) {
  /* USER CODE BEGIN OnTxData_1 */
  if ((params != NULL)) {
    /* Process Tx event only if its a mcps response to prevent some internal
     * events (mlme) */
    if (params->IsMcpsConfirm != 0) {
      APP_LOG(TS_OFF, VLEVEL_M,
              "\r\n###### ========== MCPS-Confirm =============\r\n");
      APP_LOG(TS_OFF, VLEVEL_H,
              "###### U/L FRAME:%04d | PORT:%d | DR:%d | PWR:%d",
              params->UplinkCounter, params->AppData.Port, params->Datarate,
              params->TxPower);

      APP_LOG(TS_OFF, VLEVEL_H, " | MSG TYPE:");
      if (params->MsgType == LORAMAC_HANDLER_CONFIRMED_MSG) {
        APP_LOG(TS_OFF, VLEVEL_H, "CONFIRMED [%s]\r\n",
                (params->AckReceived != 0) ? "ACK" : "NACK");
      } else {
        APP_LOG(TS_OFF, VLEVEL_H, "UNCONFIRMED\r\n");
      }
    }
  }
  /* USER CODE END OnTxData_1 */
}

static void OnJoinRequest(LmHandlerJoinParams_t *joinParams) {
  /* USER CODE BEGIN OnJoinRequest_1 */
  if (joinParams != NULL) {
    if (joinParams->Status == LORAMAC_HANDLER_SUCCESS) {
      APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### = JOINED = ");
      if (joinParams->Mode == ACTIVATION_TYPE_ABP) {
        APP_LOG(TS_OFF, VLEVEL_M, "ABP ======================\r\n");
      } else {
        APP_LOG(TS_OFF, VLEVEL_M, "OTAA =====================\r\n");
      }

    } else {
      APP_LOG(TS_OFF, VLEVEL_M, "\r\n###### = JOIN FAILED\r\n");
    }
  }
  /* USER CODE END OnJoinRequest_1 */
}

static void OnBeaconStatusChange(LmHandlerBeaconParams_t *params) {
  /* USER CODE BEGIN OnBeaconStatusChange_1 */
  /* USER CODE END OnBeaconStatusChange_1 */
}

static void OnSysTimeUpdate(void) {
  /* USER CODE BEGIN OnSysTimeUpdate_1 */

  /* USER CODE END OnSysTimeUpdate_1 */
}

static void OnClassChange(DeviceClass_t deviceClass) {
  /* USER CODE BEGIN OnClassChange_1 */
  /* USER CODE END OnClassChange_1 */
}

static void OnMacProcessNotify(void) {
  /* USER CODE BEGIN OnMacProcessNotify_1 */

  /* USER CODE END OnMacProcessNotify_1 */
  UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LmHandlerProcess), CFG_SEQ_Prio_0);

  /* USER CODE BEGIN OnMacProcessNotify_2 */

  /* USER CODE END OnMacProcessNotify_2 */
}

static void OnTxPeriodicityChanged(uint32_t periodicity) {
  /* USER CODE BEGIN OnTxPeriodicityChanged_1 */

  /* USER CODE END OnTxPeriodicityChanged_1 */
  TxPeriodicity = periodicity;

  if (TxPeriodicity == 0) {
    /* Revert to application default periodicity */
    TxPeriodicity = APP_TX_DUTYCYCLE;
  }

  /* Update timer periodicity */
  UTIL_TIMER_Stop(&TxTimer);
  UTIL_TIMER_SetPeriod(&TxTimer, TxPeriodicity);
  UTIL_TIMER_Start(&TxTimer);
  /* USER CODE BEGIN OnTxPeriodicityChanged_2 */

  /* USER CODE END OnTxPeriodicityChanged_2 */
}

static void OnTxFrameCtrlChanged(LmHandlerMsgTypes_t isTxConfirmed) {
  /* USER CODE BEGIN OnTxFrameCtrlChanged_1 */

